# -*- coding: utf-8 -*-
"""лабм7.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1I1BbdNmevciSWRJCWV3zd0gGs2gdih2R
"""

import random
from math import gcd

# ===== P-метод Полларда для дискретного логарифмирования =====
def pollard_rho_dlog(p: int, a: int, b: int, r: int, max_iter: int = 10000) -> int:
    """
    Алгоритм Полларда (ро-метод) для решения задачи дискретного логарифма:
    Найти x такой, что a^x ≡ b (mod p), где порядок a равен r.
    """
    # Определяем три множества для функции итерации
    def f(x: int, alpha: int, beta: int, p: int, a: int, b: int, r: int) -> tuple:
        """Функция итерации для метода Полларда"""
        if x % 3 == 0:
            # Группа 1: x = (x * b) mod p, alpha = alpha, beta = (beta + 1) mod r
            return (x * b) % p, alpha, (beta + 1) % r
        elif x % 3 == 1:
            # Группа 2: x = (x * x) mod p, alpha = (2 * alpha) mod r, beta = (2 * beta) mod r
            return (x * x) % p, (2 * alpha) % r, (2 * beta) % r
        else:
            # Группа 3: x = (x * a) mod p, alpha = (alpha + 1) mod r, beta = beta
            return (x * a) % p, (alpha + 1) % r, beta

    # Инициализация: начинаем с двух последовательностей
    x1, alpha1, beta1 = 1, 0, 0
    x2, alpha2, beta2 = 1, 0, 0

    for i in range(max_iter):
        # Один шаг для медленной последовательности
        x1, alpha1, beta1 = f(x1, alpha1, beta1, p, a, b, r)

        # Два шага для быстрой последовательности
        x2, alpha2, beta2 = f(x2, alpha2, beta2, p, a, b, r)
        x2, alpha2, beta2 = f(x2, alpha2, beta2, p, a, b, r)

        # Проверяем на коллизию
        if x1 == x2:
            # Найдена коллизия: a^alpha1 * b^beta1 ≡ a^alpha2 * b^beta2 (mod p)
            # Тогда a^(alpha1 - alpha2) ≡ b^(beta2 - beta1) (mod p)
            # Так как b = a^x, то a^(alpha1 - alpha2) ≡ a^(x*(beta2 - beta1)) (mod p)
            # Отсюда (alpha1 - alpha2) ≡ x*(beta2 - beta1) (mod r)

            delta_alpha = (alpha1 - alpha2) % r
            delta_beta = (beta2 - beta1) % r

            if delta_beta == 0:
                # Если delta_beta = 0, то коллизия тривиальна
                continue

            # Находим обратный элемент к delta_beta по модулю r
            try:
                inv_delta_beta = pow(delta_beta, -1, r)
            except ValueError:
                # Если delta_beta не взаимно прост с r, пробуем другой подход
                g = gcd(delta_beta, r)
                delta_beta //= g
                r_prime = r // g
                delta_alpha //= g

                inv_delta_beta = pow(delta_beta, -1, r_prime)
                x_candidate = (delta_alpha * inv_delta_beta) % r_prime

                # Проверяем все возможные решения
                for k in range(g):
                    x_test = (x_candidate + k * r_prime) % r
                    if pow(a, x_test, p) == b:
                        return x_test
            else:
                # Обычный случай: delta_beta обратим по модулю r
                x_candidate = (delta_alpha * inv_delta_beta) % r

                # Проверяем кандидата
                if pow(a, x_candidate, p) == b:
                    return x_candidate

    raise ValueError(f"Коллизия не найдена за {max_iter} итераций")

def verify_dlog(p: int, a: int, b: int, x: int) -> bool:
    """
    Проверка корректности вычисленного дискретного логарифма
    """
    return pow(a, x, p) == b

# ===== Пример использования =====
if __name__ == "__main__":
    p = 107
    a = 10
    b = 64
    r = 53  # Порядок элемента a в группе

    print(f"Параметры задачи:")
    print(f"p = {p} (порядок группы)")
    print(f"a = {a} (основание)")
    print(f"b = {b} (значение)")
    print(f"r = {r} (порядок элемента a)")
    print()

    try:
        # Вычисляем логарифм
        x = pollard_rho_dlog(p, a, b, r, max_iter=100000)
        print(f"Найденный x: {x}")

        # Проверяем корректность
        if verify_dlog(p, a, b, x):
            print(f"Проверка пройдена: {a}^{x} ≡ {b} (mod {p})")
        else:
            print(f"Ошибка: {a}^{x} ≠ {b} (mod {p})")

    except ValueError as e:
        print(f"Ошибка: {e}")

    # Дополнительная проверка
    print()
    print("Проверка перебором (для демонстрации):")
    for test_x in range(r):
        if pow(a, test_x, p) == b:
            print(f"x = {test_x}: {a}^{test_x} mod {p} = {pow(a, test_x, p)}")